blog_api/app/controllers/blog_posts_controller.rb

  def create
    @blog_post = BlogPost.new(blog_post_params)

    if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "It's broken!"], ["author", "corinna"], ["content", "test"], ["created_at", "2020-06-09 14:56:26.426899"], ["updated_at", "2020-06-09 14:56:26.426899"]]